LANG = {
    username_length: "Никнейм должен содержать от 4 до 32 символов",
    username_regex: 'Никнейм должен состоять из букв, цифр или символов "-" и "_"',
    username_duplicate: "Такой никнейм уже зарегистрирован",
    email_length: "Адрес эл. почты должен содержать от 4 до 100 символов",
    email_regex: "Адрес эл. почты почты введен некорректно",
    email_duplicate: "Такой эл. адрес почты уже зарегистрирован",
    password_length: "Пароль должен содержать от 4 до 32 символов",
    password_not_match: "Пароли не совпадают",

    attribute_length: "Атрибут должен содержать от 3 до 32 символов",
    attribute_duplicate: "Данный атрибут уже существует",
    add_attribute: "Добавить атрибут",
    param_length:"Параметр должен содержать от 3 до 32 символов",

    comment_length: "Комментарий должен содержать от 0 до 1000 символов",
    comment_forbidden: "Отказано в доступе",
    comment_deleted: "Комментарий был удален",

    title_length: "Заголовок должен содержать от 4 до 32 символов",
    title_duplicate: "Такой заголовок уже существует",
    content_length: "Содержание должно содержать от 1000 до 100000 символов",
    dropzone_invalid: "Ошибка в поле для картики",
    dropzone_defaultMessage: "Перетяните сюда изображение или кликните сюда, чтобы выбрать файл",
    dropzone_filetype: "Неподходящий тип файла",
    dropzone_upload: "Ошибув загрузки",
    dropzone_remove: "Удалить",
    dropzone_maxFilesExceeded: "Только один файл может быть загружен",
    dropzone_fileTooBig: "Размер файла слишком большой",

    category_length: "Категория должна содержать от 3 до 20 символов",
    category_duplicate: "Категория с таким именем уже существует",
    category_has_subcategories: "Вы должны удалить все подкатегории перед удалением этой",
    category_not_selected: "Пожалуйста, укажите категорию",
    category_has_articles: "Существуют статьи с данной категорией"
}