LANG = {
    username_length: "Никнейм должен содержать от 4 до 32 символов",
    username_regex: 'Никнейм должен состоять из букв, цифр или символов "-" и "_"',
    username_duplicate: "Такой никнейм уже зарегистрирован",
    email_length: "Адрес эл. почты должен содержать от 4 до 100 символов",
    email_regex: "Адрес эл. почты почты введен некорректно",
    email_duplicate: "Такой эл. адрес почты уже зарегистрирован",
    password_length: "Пароль должен содержать от 4 до 32 символов",
    password_not_match: "Пароли не совпадают"
}